sdaiCreateNestedAggrADB(Sdai_Id_aggr*,Sdai_ADBId*)
\details
Creates a nested aggregate in a specified aggregate.
\param aggregate       [in] An aggregate that should contain the newly created aggregate.
\param selaggrInstance [in] An attribute data block (ADB) that represents the aggregate data type.
\returns The created SDAI aggregate object.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiAI_NVLD - Aggregate instance invalid.
* sdaiVA_NSET - Value not set.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiSY_ERR - Underlying system error.